; domain
(define (domain CAJAS_domain)
  (:requirements :strips)
  (:predicates
    (SOBRE ?x ?y)
    (LIBRE ?x)
    (SOSTENER ?x)
    (ENMESA ?x)
    (MANOLIBRE)
  )
(:action AGARRAR
    :parameters (?x)
    :precondition (and (LIBRE ?x) (ENMESA ?x) (MANOLIBRE))
    :effect (and (not (ENMESA ?x))
                 (not (LIBRE ?x))
                 (not (MANOLIBRE))
                 (SOSTENER ?x)))


(:action BAJAR
    :parameters (?x)
    :precondition (SOSTENER ?x)
    :effect (and (not (SOSTENER ?x))
                 (LIBRE ?x)
                 (MANOLIBRE)
                 (ENMESA ?x)))


(:action APILAR
    :parameters (?x ?y)
    :precondition (and (SOSTENER ?x) (LIBRE ?y))
    :effect (and (not (SOSTENER ?x))
                 (not (LIBRE ?y))
                 (LIBRE ?x)
                 (MANOLIBRE)
                 (SOBRE ?x ?y)))


(:action DESAPILAR
    :parameters (?x ?y)
    :precondition (and (SOBRE ?x ?y) (LIBRE ?x) (MANOLIBRE))
    :effect (and (SOSTENER ?x)
                 (LIBRE ?y)
                 (not (LIBRE ?x))
                 (not (MANOLIBRE))
                 (not (SOBRE ?x ?y))))

)

; problem
(define 
(problem CAJAS-4)
(:domain CAJAS_domain)
(:objects ARANDELA TUERCA CLAVO TORNILLO)
(:init (MANOLIBRE)
(LIBRE TUERCA)
(ENMESA CLAVO)
(SOBRE TUERCA TORNILLO)
(SOBRE TORNILLO ARANDELA)
(SOBRE ARANDELA CLAVO)
)
(:goal (and (MANOLIBRE)
(LIBRE TUERCA)
(ENMESA CLAVO)
(SOBRE TUERCA ARANDELA)
(SOBRE ARANDELA TORNILLO)
(SOBRE TORNILLO CLAVO)
))
)

; plan
1. (desapilar tuerca tornillo)
   deleted: (libre tuerca) (manolibre) (sobre tuerca tornillo)
   added: (sostener tuerca) (libre tornillo)
   goals met: 1 of 6
2. (bajar tuerca)
   deleted: (sostener tuerca)
   added: (libre tuerca) (manolibre) (enmesa tuerca)
   goals met: 3 of 6
3. (desapilar tornillo arandela)
   deleted: (libre tornillo) (manolibre) (sobre tornillo arandela)
   added: (sostener tornillo) (libre arandela)
   goals met: 2 of 6
4. (bajar tornillo)
   deleted: (sostener tornillo)
   added: (libre tornillo) (manolibre) (enmesa tornillo)
   goals met: 3 of 6
5. (desapilar arandela clavo)
   deleted: (libre arandela) (manolibre) (sobre arandela clavo)
   added: (sostener arandela) (libre clavo)
   goals met: 2 of 6
6. (bajar arandela)
   deleted: (sostener arandela)
   added: (libre arandela) (manolibre) (enmesa arandela)
   goals met: 3 of 6
7. (agarrar tornillo)
   deleted: (enmesa tornillo) (libre tornillo) (manolibre)
   added: (sostener tornillo)
   goals met: 2 of 6
8. (apilar tornillo clavo)
   deleted: (sostener tornillo) (libre clavo)
   added: (libre tornillo) (manolibre) (sobre tornillo clavo)
   goals met: 4 of 6
9. (agarrar arandela)
   deleted: (enmesa arandela) (libre arandela) (manolibre)
   added: (sostener arandela)
   goals met: 3 of 6
10. (apilar arandela tornillo)
   deleted: (sostener arandela) (libre tornillo)
   added: (libre arandela) (manolibre) (sobre arandela tornillo)
   goals met: 5 of 6
11. (agarrar tuerca)
   deleted: (enmesa tuerca) (libre tuerca) (manolibre)
   added: (sostener tuerca)
   goals met: 3 of 6
12. (apilar tuerca arandela)
   deleted: (sostener tuerca) (libre arandela)
   added: (libre tuerca) (manolibre) (sobre tuerca arandela)
   goals met: 6 of 6
